HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxDsadc_regdef.h
/** \\brief  Global Configuration Register */
typedef struct _Ifx_DSADC_GLOBCFG_Bits
{
    unsigned int MCSEL:3;                   /**< \brief [2:0] Modulator Clock Select (rw) */
    unsigned int reserved_3:8;              /**< \brief \internal Reserved */
    unsigned int IRM0:1;                    /**< \brief [11:11] Internal Resistance Measurement Control (rw) */
    unsigned int IRM2:1;                    /**< \brief [12:12] Internal Resistance Measurement Control (rw) */
    unsigned int IRM4:1;                    /**< \brief [13:13] Internal Resistance Measurement Control (rw) */
    unsigned int reserved_14:18;            /**< \brief \internal Reserved */
} Ifx_DSADC_GLOBCFG_Bits;

/** \\brief  Global Run Control Register */
typedef struct _Ifx_DSADC_GLOBRC_Bits
{
    unsigned int CHRUN:6;                   /**< \brief [5:0] Channel x Run Control (rw) */
    unsigned int reserved_6:10;             /**< \brief \internal Reserved */
    unsigned int MRUN:6;                    /**< \brief [21:16] Modulator x Run Control (rw) */
    unsigned int reserved_22:10;            /**< \brief \internal Reserved */
} Ifx_DSADC_GLOBRC_Bits;

/** \\brief  Module Identification Register */
typedef struct _Ifx_DSADC_ID_Bits
{
    unsigned int MODREV:8;                  /**< \brief [7:0] Module Revision Number (r) */
    unsigned int MODTYPE:8;                 /**< \brief [15:8] Module Type (r) */
    unsigned int MODNUMBER:16;              /**< \brief [31:16] Module Number Value (r) */
} Ifx_DSADC_ID_Bits;

/** \\brief  Kernel Reset Register 0 */
typedef struct _Ifx_DSADC_KRST0_Bits
{
    unsigned int RST:1;                     /**< \brief [0:0] Kernel Reset (rwh) */
    unsigned int RSTSTAT:1;                 /**< \brief [1:1] Kernel Reset Status (rh) */
    unsigned int reserved_2:30;             /**< \brief \internal Reserved */
} Ifx_DSADC_KRST0_Bits;

/** \\brief  Kernel Reset Register 1 */
typedef struct _Ifx_DSADC_KRST1_Bits
{
    unsigned int RST:1;                     /**< \brief [0:0] Kernel Reset (rwh) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_DSADC_KRST1_Bits;

/** \\brief  Kernel Reset Status Clear Register */
typedef struct _Ifx_DSADC_KRSTCLR_Bits
{
    unsigned int CLR:1;                     /**< \brief [0:0] Kernel Reset Status Clear (w) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_DSADC_KRSTCLR_Bits;

/** \\brief  OCDS Control and Status Register */
typedef struct _Ifx_DSADC_OCS_Bits
{
    unsigned int reserved_0:24;             /**< \brief \internal Reserved */
    unsigned int SUS:4;                     /**< \brief [27:24] OCDS Suspend Control (rw) */
    unsigned int SUS_P:1;                   /**< \brief [28:28] SUS Write Protection (w) */
    unsigned int SUSSTA:1;                  /**< \brief [29:29] Suspend State (rh) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_DSADC_OCS_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Dsadc_union
 * \{  */

/** \\brief  Access Enable Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DSADC_ACCEN0_Bits B;
} Ifx_DSADC_ACCEN0;

/** \\brief  Access Protection Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DSADC_ACCPROT_Bits B;
} Ifx_DSADC_ACCPROT;

/** \\brief  Carrier Generator Configuration Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DSADC_CGCFG_Bits B;
} Ifx_DSADC_CGCFG;

/** \\brief  Boundary Select Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DSADC_CH_BOUNDSEL_Bits B;
} Ifx_DSADC_CH_BOUNDSEL;

/** \\brief  Carrier Generator Synchronization Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DSADC_CH_CGSYNC_Bits B;
} Ifx_DSADC_CH_CGSYNC;

/** \\brief  Demodulator Input Configuration Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DSADC_CH_DICFG_Bits B;
} Ifx_DSADC_CH_DICFG;

/** \\brief  Filter Configuration Register, Auxiliary Filter */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DSADC_CH_FCFGA_Bits B;
} Ifx_DSADC_CH_FCFGA;

/** \\brief  Filter Configuration Register, Main Comb Filter */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DSADC_CH_FCFGC_Bits B;
} Ifx_DSADC_CH_FCFGC;

/** \\brief  Filter Configuration Register, Main Filter Chain */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DSADC_CH_FCFGM_Bits B;
} Ifx_DSADC_CH_FCFGM;

/** \\brief  Integration Window Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DSADC_CH_IWCTR_Bits B;
} Ifx_DSADC_CH_IWCTR;

/** \\brief  Modulator Configuration Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DSADC_CH_MODCFG_Bits B;
} Ifx_DSADC_CH_MODCFG;

/** \\brief  Offset Register Main Filter */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DSADC_CH_OFFM_Bits B;
} Ifx_DSADC_CH_OFFM;

/** \\brief  Rectification Configuration Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DSADC_CH_RECTCFG_Bits B;
} Ifx_DSADC_CH_RECTCFG;

/** \\brief  Result Register Auxiliary Filter */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DSADC_CH_RESA_Bits B;
} Ifx_DSADC_CH_RESA;

/** \\brief  Result Register Main Filter */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DSADC_CH_RESM_Bits B;
} Ifx_DSADC_CH_RESM;

/** \\brief  Time-Stamp Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DSADC_CH_TSTMP_Bits B;
} Ifx_DSADC_CH_TSTMP;

/** \\brief  Clock Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DSADC_CLC_Bits B;
} Ifx_DSADC_CLC;

/** \\brief  Event Flag Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DSADC_EVFLAG_Bits B;
} Ifx_DSADC_EVFLAG;

/** \\brief  Event Flag Clear Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DSADC_EVFLAGCLR_Bits B;
} Ifx_DSADC_EVFLAGCLR;

